# ф.н. 3MI0700035
# името ви Иван Петров
# специалността Информационни Системи


### Задача 1
# Наблюдавани стойности
peanut <- 267  # брой на фъстъци
hazelnut <- 91   # брой на лешници
cashew <- 103  # брой на кашу
almond <- 500 - peanut - hazelnut - cashew  # брой на бадеми

observed <- c(peanut, hazelnut, cashew, almond)
mean(observed)
median(observed)
expected <- c(5, 2, 2, 1)
expected <- expected / sum(expected)
result <- chisq.test(observed, p = expected)

result

# Проверка на хипотезата чрез Хи-квадрат
alpha <- 0.015  # ниво на значимост
if (result$p.value < alpha) {
    cat("Отхвърляме нулевата хипотеза. Машината не смесва ядките в желаното съотношение.\n")
} else {
    cat(
        "Не можем да отхвърлим нулевата хипотеза. Машината смесва ядките в желаното съотношение.\n"
    )
}
df <- length(observed) - 1


library(graphics)
# Графика на плътността
curve(
    dchisq(x, df = df),
    xlim = c(0, max(observed) + 50),
    xlab = "Брой ядки",
    ylab = "Плътност",
    main = "Разпределение на хи-квадрат статистиката"
)

# Критична област
critical_value <- qchisq(1 - alpha, df = df)
abline(v = critical_value, col = "red", lwd = 2)

# Емпирична характеристика
empirical_value <- result$statistic
abline(v = empirical_value, col = "blue", lwd = 2)



### Задача 2
# Данни за експеримента
n1 <- 500  # Брой елементи, сглобени от робот
n2 <- 500    # Брой елементи, сглобени от човек

x1 <- 15   # Брой дефектни елементи, сглобени от робот
x2 <- 0.035 * n2    # Брой дефектни елементи, сглобени от човек

# Пропорциите на дефектни елементи
# Пропорция на дефектни елементи при използване на робот
p1 <- x1 / n1
# Пропорция на дефектни елементи при сглобяване от човек
p2 <- x2 / n2


# Извършване на хипотезен тест
result <-
    prop.test(
        x = c(x1, x2),
        n = c(n1, n2),
        alternative = "less",
        correct = FALSE
    )

# Отпечатване на резултата
result
if (result$p.value < alpha) {
    cat("Роботът прави по-малко дефектни от човека.\n")
} else {
    cat(
        "Робота не прави по-малко дефектни от човека.\n"
    )
}



### Задача 3
x = c(30208.61, 30031.48, 31369.72, 30423.30, 28508.69, 30909.14, 29951.86,
      29651.07, 30092.92, 28934.14, 29548.45, 28838.97, 30333.31, 30535.98,
      31070.35, 31016.58, 28130.97, 29661.08, 30401.63, 31377.73, 29469.36,
      30411.83, 29530.51, 29803.23, 29491.12, 30340.85, 30239.38, 29328.12,
      30892.51, 31095.85, 30180.62, 28347.43, 30056.37, 30103.87, 29520.86,
      30201.51, 32292.90, 30325.08, 30318.04, 30460.16, 30902.91, 29832.22,
      31682.61, 30667.66, 31644.24, 30333.04, 29248.99, 29039.49)
y = c(30138.48, 28128.17, 28457.52, 30869.64, 28350.69, 29833.84, 29906.35,
      27893.71, 30651.77, 29306.76, 29694.77, 28871.06, 29111.43, 29633.97,
      27248.59, 29677.19, 27304.51, 28393.82, 29049.14, 28471.64, 29624.78,
      30197.94, 29329.87, 28435.96, 29566.51, 28194.91, 29506.66, 28668.88,
      32377.36, 28764.72, 27153.31, 29129.34, 28193.12, 28103.39, 27355.46,
      29829.73, 30631.48, 29152.45, 30994.12, 30083.63, 29757.24, 28243.70,
      29023.39, 28290.52, 28230.68, 29105.40, 28693.04, 29281.10)

alpha = 0.015


# Тестване на хипотезите
t_test <- t.test(x, y, alternative = "greater", var.equal = TRUE)

# Отпечатване на резултатите
print(t_test)

# Нарисуване на графика на плътността на разпределението
curve(
    dt(x, df = length(x) + length(y) - 2),
    xlim = c(-10, 10),
    ylim = c(0, 0.4),
    xlab = "t-статистика",
    ylab = "Плътност",
    main = "Графика на плътността на разпределението"
)
abline(
    v = qt(1 - alpha, df = length(x) + length(y) - 2),
    col = "red",
    lwd = 2
)  # Критична област в червено
abline(v = t_test$statistic,
       col = "blue",
       lwd = 2)  # Емпирична статистика в синьо



### Задача 4
Height = c(189, 193, 190, 191, 192, 188, 187, 191, 194, 194, 193, 182, 183,
           191, 192, 193, 195, 196, 189, 186, 188, 189, 185, 190, 184, 179,
           180, 178, 177, 175, 181, 179, 186, 175, 170, 175, 169, 165, 169,
           170, 173, 175, 184, 180, 182, 184, 183, 181, 178, 174)
Weight = c(89, 92, 90, 91, 93, 87, 90, 93, 96, 95, 94, 83, 84, 92, 92, 96, 94,
           97, 89, 84, 90, 92, 87, 92, 85, 85, 83, 84, 81, 78, 90, 81, 93, 84,
           78, 80, 74, 68, 72, 76, 78, 79, 88, 90, 94, 96, 95, 93, 82, 77)
Hips = c(112, 112, 110, 111, 113, 107, 112, 115, 115, 117, 116, 102, 101, 113,
         114, 115, 117, 118, 112, 111, 113, 114, 109, 113, 101, 123, 125, 128,
         123, 118, 113, 108, 113, 108, 105, 102, 96, 88, 84, 99, 102, 105,
         134, 140, 146, 152, 150, 149, 104, 112)
ShouldersWidth = c(40, 42, 39, 39, 40, 37, 40, 41, 42, 42, 41, 37, 38, 41, 42,
                   42, 43, 44, 40, 39, 40, 41, 40, 43, 37, 38, 39, 40, 42, 41,
                   39, 38, 40, 41, 38, 39, 40, 39, 43, 39, 42, 38, 39, 38, 41,
                   42, 39, 38, 43, 42)

data <- data.frame(Height, Weight, Hips, ShouldersWidth)
## 1

model <- lm(Hips ~ Height + Weight + ShouldersWidth, data = data)
summary(model)
## 2
coefficients <- coef(model)
coefficients
## 3
# височината (Height), теглото (Weight) 
# и ширината на раменете (ShouldersWidth).

## 4 
#Хипотезите, които ще проверя, са:
# H0: Коефициентът пред Height е равен на 0 (без значима зависимост между талията и височината).
# H0: Коефициентът пред Weight е равен на 0 (без значима зависимост между талията и теглото).
# H0: Коефициентът пред ShouldersWidth е равен на 0 (без значима зависимост между талията и ширината на раменете).

## 5
#За да определим кои от коефициентите са статистически значими, можем да разгледаме стойностите на t-статистиката и p-стойностите в резултатите от summary(model).
summary(model)

## 6
# Изключване на статистически незначимите фактори
final_model <- step(model)
summary(final_model)
coefs <- coef(final_model)

## 7
Waist = coefs[1] + coefs[2] * Height + coefs[3] * Weight
Waist

## 8 
residuals <- residuals(final_model)
head(residuals, 5)

## 9
# Проверка за нормалност на разпределението на грешката
shapiro.test(residuals)

# Проверка на хипотезата за очакването на грешката на модела
t.test(residuals)

# Проверка за зависимостта между грешките и значимите фактори
anova_result <- aov(residuals ~ Height + Weight + ShouldersWidth, data = data)
summary(anova_result)

## 10
summary(final_model)$sigma

## 11
summary(final_model)$r.squared

##12
#За да определим дали моделът е адекватен,
#трябва да разгледаме стойностите на p-стойностите
#за коефициентите и коефициента на детерминация.
summary(model)


## 13
expected_waist <- coefs[1] + coefs[2] * 173 + coefs[3] * 85
expected_waist

