// P05-Combine2ArraysInSortedArray.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>

int main()
{
	std::cout << "Hello World!\n";
}


//Задача 4
//Да се напише функция, която, по подадени указатели към два сортирани масива и съответните им размери и подаден трети масив, слива първите два масива в третия, така че полученият масив отново да е сортиран, без да се прилага допълнително сорнитане.Приемаме, че масивите са от цели числа .